// search index for WYSIWYG Web Builder
var database_length = 0;

function SearchPage(url, title, keywords, description)
{
   this.url = url;
   this.title = title;
   this.keywords = keywords;
   this.description = description;
   return this;
}

function SearchDatabase()
{
   database_length = 0;
   this[database_length++] = new SearchPage("index.html", "Географія. 9 клас", " © 2026 ТОВ \"Генеза\"   ", "");
   this[database_length++] = new SearchPage("page1.html", "Географія. 9 клас", "ВСТУП  КОРИСНА ТА ЦІКАВА ІНФОРМАЦІЯ  ПЕРЕВІРТЕ СВОЇ ЗНАННЯ  НА ДОЗВІЛЛІ  ПРАЦЮЄМО З ПІДРУЧНИКОМ  У вільний час подивіться цікаві відео    ", "");
   this[database_length++] = new SearchPage("page2.html", "Географія. 9 клас", "ТЕМА 1 НАЦІОНАЛЬНА ЕКОНОМІКА  РОЗДІЛ 1 НАЦІОНАЛЬНА ТА СВІТОВА ЕКОНОМІКИ  ПРАЦЮЄМО З ПІДРУЧНИКОМ  КОРИСНІ ПОСИЛАННЯ  ПЕРЕВІРТЕ СВОЇ ЗНАННЯ  НА ДОЗВІЛЛІ  Складіть пазл   ", "");
   this[database_length++] = new SearchPage("page3.html", "Географія. 9 клас", "ТЕМА 2 СВІТОВА ЕКОНОМІКА  РОЗДІЛ 1 НАЦІОНАЛЬНА ТА СВІТОВА ЕКОНОМІКИ  ПРАЦЮЄМО З ПІДРУЧНИКОМ  КОРИСНА ТА ЦІКАВА ІНФОРМАЦІЯ  КОРИСНІ ПОСИЛАННЯ  ПЕРЕВІРТЕ СВОЇ ЗНАННЯ  НА ДОЗВІЛЛІ  Складіть пазл   ", "");
   this[database_length++] = new SearchPage("page4.html", "Географія. 9 клас", "ТЕМА 1 СІЛЬСЬКЕ ГОСПОДАРСТВО  РОЗДІЛ 2 ПЕРВИННИЙ СЕКТОР ЕКОНОМІКИ  ПРАЦЮЄМО З ПІДРУЧНИКОМ  КОРИСНА ТА ЦІКАВА ІНФОРМАЦІЯ  КОРИСНІ ПОСИЛАННЯ  ПЕРЕВІРТЕ СВОЇ ЗНАННЯ  НА ДОЗВІЛЛІ  У вільний час подивіться цікаві відео    ", "");
   this[database_length++] = new SearchPage("page5.html", "Географія. 9 клас", "ТЕМА 2 ЛІСОВЕ ГОСПОДАРСТВО  РОЗДІЛ 2 ПЕРВИННИЙ СЕКТОР ЕКОНОМІКИ  ПРАЦЮЄМО З ПІДРУЧНИКОМ  КОРИСНА ТА ЦІКАВА ІНФОРМАЦІЯ  КОРИСНІ ПОСИЛАННЯ  ПЕРЕВІРТЕ СВОЇ ЗНАННЯ  НА ДОЗВІЛЛІ  У вільний час подивіться цікаві відео   Складіть пазл та визначте, який процес зафіксований на світлині    ", "");
   this[database_length++] = new SearchPage("page6.html", "Географія. 9 клас", "РОЗДІЛ 2 ПЕРВИННИЙ СЕКТОР ЕКОНОМІКИ  ПРАЦЮЄМО З ПІДРУЧНИКОМ  КОРИСНА ТА ЦІКАВА ІНФОРМАЦІЯ  КОРИСНІ ПОСИЛАННЯ  ПЕРЕВІРТЕ СВОЇ ЗНАННЯ  НА ДОЗВІЛЛІ  У вільний час подивіться цікаві відео   ТЕМА 3 ДОБУВНА ПРОМИСЛОВІСТЬ   ", "");
   this[database_length++] = new SearchPage("page7.html", "Географія. 9 клас", "ПРАЦЮЄМО З ПІДРУЧНИКОМ  КОРИСНА ТА ЦІКАВА ІНФОРМАЦІЯ  КОРИСНІ ПОСИЛАННЯ  ПЕРЕВІРТЕ СВОЇ ЗНАННЯ  НА ДОЗВІЛЛІ  У вільний час подивіться цікаві відео   ТЕМА 1 ВИРОБНИЦТВО ТА ПОСТАЧАННЯ ЕЛЕКТРОЕНЕРГІЇ  РОЗДІЛ 3 ВТОРИННИЙ СЕКТОР ЕКОНОМІКИ  Складіть пазл та визначте, до якого типу належить електростанція на зображенні   ", "");
   this[database_length++] = new SearchPage("page8.html", "Географія. 9 клас", "ПРАЦЮЄМО З ПІДРУЧНИКОМ  КОРИСНА ТА ЦІКАВА ІНФОРМАЦІЯ  КОРИСНІ ПОСИЛАННЯ  ПЕРЕВІРТЕ СВОЇ ЗНАННЯ  НА ДОЗВІЛЛІ  У вільний час подивіться цікаве відео   ТЕМА 2 МЕТАЛУРГІЙНЕ ВИРОБНИЦТВО  РОЗДІЛ 3 ВТОРИННИЙ СЕКТОР ЕКОНОМІКИ   ", "");
   this[database_length++] = new SearchPage("page9.html", "Географія. 9 клас", "ПРАЦЮЄМО З ПІДРУЧНИКОМ  КОРИСНА ТА ЦІКАВА ІНФОРМАЦІЯ  ПЕРЕВІРТЕ СВОЇ ЗНАННЯ  НА ДОЗВІЛЛІ  У вільний час подивіться цікаві відео   ТЕМА 3 ХІМІЧНЕ ВИРОБНИЦТВО ВИРОБНИЦТВО ДЕРЕВИНИ, ПАПЕРУ  РОЗДІЛ 3 ВТОРИННИЙ СЕКТОР ЕКОНОМІКИ   ", "");
   this[database_length++] = new SearchPage("page10.html", "Географія. 9 клас", "ПРАЦЮЄМО З ПІДРУЧНИКОМ  КОРИСНА ТА ЦІКАВА ІНФОРМАЦІЯ  ПЕРЕВІРТЕ СВОЇ ЗНАННЯ  НА ДОЗВІЛЛІ  У вільний час подивіться цікаве відео   ТЕМА 4 ВИРОБНИЦТВО МАШИН ТА УСТАТКУВАННЯ  РОЗДІЛ 3 ВТОРИННИЙ СЕКТОР ЕКОНОМІКИ  КОРИСНІ ПОСИЛАННЯ   ", "");
   this[database_length++] = new SearchPage("page11.html", "Географія. 9 клас", "ПРАЦЮЄМО З ПІДРУЧНИКОМ  КОРИСНА ТА ЦІКАВА ІНФОРМАЦІЯ  ПЕРЕВІРТЕ СВОЇ ЗНАННЯ  НА ДОЗВІЛЛІ  У вільний час подивіться цікаві відео   ТЕМА 5 ВИРОБНИЦТВО ТКАНИН, ОДЯГУ, ВЗУТТЯ  РОЗДІЛ 3 ВТОРИННИЙ СЕКТОР ЕКОНОМІКИ  КОРИСНІ ПОСИЛАННЯ   ", "");
   this[database_length++] = new SearchPage("page12.html", "Географія. 9 клас", "ПРАЦЮЄМО З ПІДРУЧНИКОМ  КОРИСНА ТА ЦІКАВА ІНФОРМАЦІЯ  ПЕРЕВІРТЕ СВОЇ ЗНАННЯ  НА ДОЗВІЛЛІ  У вільний час подивіться цікаві відео   ТЕМА 6 ВИРОБНИЦТВО ХАРЧОВИХ ПРОДУКТІВ, НАПОЇ  РОЗДІЛ 3 ВТОРИННИЙ СЕКТОР ЕКОНОМІКИ   ", "");
   this[database_length++] = new SearchPage("page13.html", "Географія. 9 клас", "ПРАЦЮЄМО З ПІДРУЧНИКОМ  КОРИСНА ТА ЦІКАВА ІНФОРМАЦІЯ  ПЕРЕВІРТЕ СВОЇ ЗНАННЯ  НА ДОЗВІЛЛІ  У вільний час подивіться цікаві відео   РОЗДІЛ 4 ТРЕТИННИЙ СЕКТОР ЕКОНОМІКИ  ТЕМА 1 ТРАНСПОРТ  КОРИСНІ ПОСИЛАННЯ   ", "");
   this[database_length++] = new SearchPage("page14.html", "Географія. 9 клас", "ПРАЦЮЄМО З ПІДРУЧНИКОМ  КОРИСНА ТА ЦІКАВА ІНФОРМАЦІЯ  ПЕРЕВІРТЕ СВОЇ ЗНАННЯ  НА ДОЗВІЛЛІ  У вільний час подивіться цікаві відео   РОЗДІЛ 4 ТРЕТИННИЙ СЕКТОР ЕКОНОМІКИ  КОРИСНІ ПОСИЛАННЯ  ТЕМА 2 ТОРГІВЛЯ   ", "");
   this[database_length++] = new SearchPage("page15.html", "Географія. 9 клас", "ПРАЦЮЄМО З ПІДРУЧНИКОМ  КОРИСНА ТА ЦІКАВА ІНФОРМАЦІЯ  ПЕРЕВІРТЕ СВОЇ ЗНАННЯ  НА ДОЗВІЛЛІ  У вільний час подивіться цікаві відео   РОЗДІЛ 4 ТРЕТИННИЙ СЕКТОР ЕКОНОМІКИ  КОРИСНІ ПОСИЛАННЯ  ТЕМА 3 ТУРИЗМ   ", "");
   this[database_length++] = new SearchPage("page16.html", "Географія. 9 клас", "ПРАЦЮЄМО З ПІДРУЧНИКОМ  КОРИСНА ТА ЦІКАВА ІНФОРМАЦІЯ  ПЕРЕВІРТЕ СВОЇ ЗНАННЯ  НА ДОЗВІЛЛІ  На дозвіллі складіть пазл Яка будівля на зображенні?  РОЗДІЛ 4 ТРЕТИННИЙ СЕКТОР ЕКОНОМІКИ  КОРИСНІ ПОСИЛАННЯ  ТЕМА 4 ФІНАНСОВІ ПОСЛУГИ ОСВІТА ТА НАУКА КОМП’ЮТЕРНЕ ПРОГРАМУВАННЯ ОХОРОНА ЗДОРОВ’Я   ", "");
   this[database_length++] = new SearchPage("page17.html", "Географія. 9 клас", "ПРАЦЮЄМО З ПІДРУЧНИКОМ  КОРИСНА ТА ЦІКАВА ІНФОРМАЦІЯ  ПЕРЕВІРТЕ СВОЇ ЗНАННЯ  НА ДОЗВІЛЛІ  РОЗДІЛ 5 ГЛОБАЛЬНІ ПРОБЛЕМИ ЛЮДСТВА  У вільний час подивіться цікаве відео    ", "");
   this[database_length++] = new SearchPage("pro.html", "Географія. 9 клас", "ПРО Е-ДОДАТОК   ", "");
   this[database_length++] = new SearchPage("title2.html", "Географія. 9 клас", "ГЕОГРАФІЯ 9 КЛАС   ", "");
   return this;
}
